Repository: SinghSyntax001/ChefGPT
Catalog: lib/l10n/app_*.arb
Languages: hi

# appTitle
source: Recipe Book
hi: रेसिपी बुक

source: Search recipes...
hi: रेसिपी खोजें...

# searchHint
source: e.g., 'quick chicken' or 'paneer'
hi: जैसे, 'झटपट चिकन' या 'पनीर'

source: Add New Recipe
hi: नई रेसिपी जोड़ें

source: Recipe Title
hi: रेसिपी का शीर्षक

# titleHint
source: e.g., Shahi Paneer
hi: जैसे, शाही पनीर

source: Ingredients
hi: सामग्री

# ingredientsHint
source: e.g., 200g paneer, 1 cup cream...
hi: जैसे, 200 ग्राम पनीर, 1 कप क्रीम...

source: Instructions
hi: निर्देश

# instructionsHint
source: e.g., 1. Cut the paneer...
hi: जैसे, 1. पनीर को काट लें...

source: Language
hi: भाषा

source: Save
hi: सहेजें

source: Delete Recipe
hi: रेसिपी हटाएं

# deleteConfirmation
source: Are you sure you want to delete this recipe?
hi: क्या आप वाकई इस रेसिपी को हटाना चाहते हैं?

source: Cancel
hi: रद्द करें

source: Delete
hi: हटाएं

# fieldCannotBeEmpty
source: This field cannot be empty
hi: यह फ़ील्ड खाली नहीं हो सकती
